:PROPERTIES:
:ID:       55ff2a7e-4b61-448a-9b1a-695319a04d17
:END:
#+TITLE: KDE: Tiling Window Management
#+CATEGORY: slips
#+TAGS:

Promoting this to its own org-roam node.

** App Configurations

Babel

#+name: footable
| not    | this |
| result | fdsa |

#+name: jointbl
#+begin_src emacs-lisp :var tbl=footable :results value
(string-join
 (flatten-list
  (mapcar (lambda (x)
            (and (>  (length x) 0) x))
          (cl-reduce #'append tbl))) ",")
#+end_src

#+RESULTS: jointbl
: not,this,result,fdsa

